In [1]:
import pandas as pd

# Задания к выполнению

1. Получить файл набора данных, прилагающийся к этой работе.

2. Считать файл в pandas DataFrame

In [41]:
df = pd.read_csv('data/Titanic.csv', sep=',')
df.head()

,Name,PClass,Age,Sex,Survived
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0
4,"Allison, Master Hudson Trevor",1st,0.92,male,1

3. Ознакомиться с основными параметрами датасета, используя функции библиотеки pandas, включая следующие данные:

    a. Количество точек данных (измерений) в наборе

In [42]:
df.shape[0]

1313

    b. Количество полей данных (атрибутов)

In [43]:
df.shape[1]

5

    c. Тип данных каждого поля, шкала каждого поля

In [44]:
df.dtypes

Name         object
PClass       object
Age         float64
Sex          object
Survived      int64
dtype: object

In [45]:
pd.Series({col_name: df[col_name].unique() for col_name in df})

Name        [Allen, Miss Elisabeth Walton, Allison, Miss H...
PClass                                   [1st, 2nd, nan, 3rd]
Age         [29.0, 2.0, 30.0, 25.0, 0.92, 47.0, 63.0, 39.0...
Sex                                            [female, male]
Survived                                               [1, 0]
dtype: object

    d. Количество отсутствующих значений для каждого поля

In [46]:
df.isna().sum()

Name          0
PClass        1
Age         557
Sex           0
Survived      0
dtype: int64

    e. Количество и названия константных и уникальных полей

In [47]:
df.apply(lambda s: len(s) - len(s.unique())) == 0

Name        False
PClass      False
Age         False
Sex         False
Survived    False
dtype: bool

4. Удалить из набора поля, не несущие информативной нагрузки - содержащие уникальные либо константные значения

In [48]:
df = df.drop('Name', axis=1)
df

     PClass    Age     Sex  Survived
0       1st  29.00  female         1
1       1st   2.00  female         0
2       1st  30.00    male         0
3       1st  25.00  female         0
4       1st   0.92    male         1
...     ...    ...     ...       ...
1308    3rd  27.00    male         0
1309    3rd  26.00    male         0
1310    3rd  22.00    male         0
1311    3rd  24.00    male         0
1312    3rd  29.00    male         0

[1313 rows x 4 columns]

5. Заменить возраст пассажиров на год рождения

In [49]:
df["Age"] = df["Age"].apply(lambda x: x if pd.isnull(x) else int(1912 - x))
df

     PClass     Age     Sex  Survived
0       1st  1883.0  female         1
1       1st  1910.0  female         0
2       1st  1882.0    male         0
3       1st  1887.0  female         0
4       1st  1911.0    male         1
...     ...     ...     ...       ...
1308    3rd  1885.0    male         0
1309    3rd  1886.0    male         0
1310    3rd  1890.0    male         0
1311    3rd  1888.0    male         0
1312    3rd  1883.0    male         0

[1313 rows x 4 columns]

6. Переименовать все названия колонок на русском языке

In [50]:
df = df.rename(columns={'PClass': 'Класс', 'Age': 'Возраст', 'Sex': 'Пол', 'Survived': 'Выжил'})
df

     Класс  Возраст     Пол  Выжил
0      1st   1883.0  female      1
1      1st   1910.0  female      0
2      1st   1882.0    male      0
3      1st   1887.0  female      0
4      1st   1911.0    male      1
...    ...      ...     ...    ...
1308   3rd   1885.0    male      0
1309   3rd   1886.0    male      0
1310   3rd   1890.0    male      0
1311   3rd   1888.0    male      0
1312   3rd   1883.0    male      0

[1313 rows x 4 columns]

7. Заменить все отсутствующие данные средним значением (в случае числового поля) либо самым распространенным в категориальных полях.

In [56]:
df.isna().sum()

Класс        0
Возраст    557
Пол          0
Выжил        0
dtype: int64

In [57]:
df['Класс'] = df['Класс'].fillna(df['Класс'].mode().item())
df['Возраст'] = df['Возраст'].fillna(df['Возраст'].mode().item())

In [58]:
df.isna().sum()

Класс      0
Возраст    0
Пол        0
Выжил      0
dtype: int64

8. Сохранить получившийся набор данных в формате CSV

In [59]:
df.to_csv('data/Titanik2.csv', encoding='cp1251', index=False)

9. Открыть данный файл в программе Microsoft Excel и сохранить в формате .xlsx

10. Считать файл .xlsx в новый DataFrame

In [61]:
df = pd.read_excel('data/Titanik2.xlsx')
df

     Класс,Возраст,Пол,Выжил
0        1st,1883.0,female,1
1        1st,1910.0,female,0
2          1st,1882.0,male,0
3        1st,1887.0,female,0
4          1st,1911.0,male,1
...                      ...
1308       3rd,1885.0,male,0
1309       3rd,1886.0,male,0
1310       3rd,1890.0,male,0
1311       3rd,1888.0,male,0
1312       3rd,1883.0,male,0

[1313 rows x 1 columns]

# Контрольные вопросы

1. Какие две главные структуры данных используются в pandas? В чем их отличие?

Series — это структура, используемая для работы с последовательностью одномерных данных. 
Dataframe — это табличная структура данных, напоминающая таблицы из Microsoft Excel. Ее главная задача — позволить использовать многомерные Series.

2. Назовите основные функции чтения данных из файлов

Pandas имеет очень много методов чтения из файла, основные из них и с которыми приходилось работать: read_csv, read_excel, read_json, read_xml

3. Напишите функцию записи набора данных А в файл с разделителями-запятыми

In [ ]:
A.to_csv('path'), sep=',')

4. Как называется функция, выводящая на экран первые N строчек набора данных?

In [ ]:
df.head(N)

5. С помощью какой функции можно удалить поле набора данных? А строку?

In [16]:
df = pd.DataFrame({'A': [1, 2], 'B': [1, 2], 'C': [1, 2]})
df = df.drop(columns=['B', 'C'])
df = df.drop([0])
df

   A
1  2

6. Напишите участок кода, демонстрирующий возможность добавления новой строки к набору данных.

In [22]:
df = pd.DataFrame(columns=['A'])
df = df.append({'A': 5}, ignore_index=True)
df

   A
0  5

7. Напишите участок кода, демонстрирующий возможность добавления новой колонки (поля) к набору данных.

In [24]:
df['B'] = df['A']
df

   A  B
0  5  5